Advices and Quotes.html
---
layout: notes
---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Anything You Want — Derek Sivers</a></li>
<li><a href="#sec-2">2. The Creative Habit: Learn It and Use It for Life — Twyla Tharp</a></li>
<li><a href="#sec-3">3. Bird by Bird: Some Instructions on Writing and Life — Anne Lamott</a></li>
<li><a href="#sec-4">4. The Art of Learning: A Journey in the Pursuit of Excellence — Josh Waitzkin</a></li>
</ul>
</div>
</nav>

<p>
Those are collections of advices and thoughts from various
sources.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Anything You Want — Derek Sivers</h2>
<div class="outline-text-2" id="text-1">
<p>
Most people don't know why they're doing what they're doing. They
imitate others, go with the flow, and follow paths without making
their own.
</p>

<p>
Any time you think you know what your new business will be doing,
remember this quote from Steve Blank: No plan survives first contact
</p>

<p>
It's counterintuitive, but the way to grow your business is to focus
entirely on your existing customers. Just thrill them, and they'll
tell everyone.
</p>

<p>
To me, ideas are worth nothing unless they are executed. They are just
a multiplier. Execution is worth millions. Explanation:
AWFUL IDEA = -1
WEAK IDEA = 1
SO-SO IDEA = 5
GOOD IDEA = 10
GREAT IDEA = 15
BRILLIANT IDEA = 20
NO EXECUTION= $1
WEAK EXECUTION = $1000
SO-SO EXECUTION = $10,000
GOOD EXECUTION = $100,000
GREAT EXECUTION = $1,000,000
BRILLIANT EXECUTION = $10,000,000
</p>

<p>
That's the Tao of business: Care about your customers more than about
yourself, and you'll do well.
</p>

<p>
See the customer tell the story himself in this great video: <a href="http://sivers.org/squid">http://sivers.org/squid</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Creative Habit: Learn It and Use It for Life — Twyla Tharp</h2>
<div class="outline-text-2" id="text-2">
<p>
Some people find this moment—the moment before creativity begins—so
painful that they simply cannot deal with it. They get up and walk
away from the computer, the canvas, the keyboard; they take a nap or
go shopping or fix lunch or do chores around the house. They
procrastinate. In its most extreme form, this terror totally paralyzes
people.
</p>

<p>
The most productive ones get started early in the morning, when the
world is quiet, the phones aren’t ringing, and their minds are rested,
alert, and not yet polluted by other people’s words.
</p>

<p>
The real secret is that they do this every day. In other words, they
are disciplined. Over time, as the daily routines become second
nature, discipline morphs into habit.
</p>

<p>
Creativity is a habit, and the best creativity is a result of good
work habits. That’s it in a nutshell.
</p>

<p>
In order to be creative you have to know how to prepare to be creative.
</p>

<p>
If art is the bridge between what you see in your mind and what the
world sees, then skill is how you build that bridge.
</p>

<p>
A lot of habitually creative people have preparation rituals linked to
the setting in which they choose to start their day. By putting
themselves into that environment, they begin their creative day.
</p>

<p>
To get the creative habit, you need a working environment that’s
habit-forming.
</p>

<p>
By making the start of the sequence automatic, they replace doubt and
fear with comfort and routine.
</p>

<p>
Solitude is an unavoidable part of creativity.
</p>

<p>
The golfer Ben Hogan said, “Every day you don’t practice you’re one
day further from being good.” If it’s something you want to do, make
the time.
</p>

<p>
Venturing out of your comfort zone may be dangerous, yet you do it
anyway because our ability to grow is directly proportional to an
ability to entertain the uncomfortable.
</p>

<p>
Creativity is more about taking the facts, fictions, and feelings we
store away and finding new ways to connect them. What we’re talking
about here is metaphor. Metaphor is the lifeblood of all art.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Bird by Bird: Some Instructions on Writing and Life — Anne Lamott</h2>
<div class="outline-text-2" id="text-3">
<p>
Good writing is about telling the truth.
</p>

<p>
Perfectionism is the voice of the oppressor, the enemy of the people.
It will keep you cramped and insane your whole life, and it is the
main obstacle between you and a shitty first draft.
</p>

<p>
This is how it works for me: I sit down in the morning and reread the
work I did the day before. And then I wool-gather, staring at the
blank page or off into space. I imagine my characters, and let myself
daydream about them. A movie begins to play in my head, with emotion
pulsing underneath it, and I stare at it in a trancelike state, until
words bounce around together and form a sentence. Then I do the menial
work of getting it down on paper, because I’m the designated typist,
and I’m also the person whose job it is to hold the lantern while the
kid does the digging. What is the kid digging for? The stuff. Details
and clues and images, invention, fresh ideas, an intuitive
understanding of people. I tell you, the holder of the lantern doesn’t
even know what the kid is digging for half the time—but she knows gold
when she sees it.
</p>

<p>
John Gardner wrote that the writer is creating a dream into which he
or she invites the reader, and that the dream must be vivid and
continuous.
</p>

<p>
You write a shitty first draft of it and you sound it out, and you
leave in those lines that ring true and take out the rest. I wish
there were an easier, softer way, a shortcut, but this is the nature
of most good writing: that you find out things as you go along. Then
you go back and rewrite. Remember: no one is reading your first
drafts.
</p>

<p>
Everyone I know flails around, kvetching and growing despondent, on
the way to finding a plot and structure that work. You are welcome to
join the club.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The Art of Learning: A Journey in the Pursuit of Excellence — Josh Waitzkin</h2>
<div class="outline-text-2" id="text-4">
<p>
Tao Te Ching, and my life took a turn.
</p>

<p>
the first step to mastering the zone is to practice the ebb and flow
of stress and recovery. This should involve interval training as I
have described above, at whatever level of difficulty is appropriate
for the age and physical conditioning of the individual.
</p>

<p>
Interval work is a critical building block to becoming a consistent
long-term performer.
</p>
</div>
</div>
